{
    "women": {
        "The Women": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=0Ua4EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=0Ua4EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Kristin Hannah"
            ],
            "categories": [
                "Fiction"
            ],
            "published_date": "2024-02-06",
            "sale_price": 14.99,
            "description": "A #1 bestseller on The New York Times, USA Today, Washington Post, and Los Angeles Times! From the celebrated author of The Nightingale and The Four Winds comes Kristin Hannah's The Women—at once an intimate portrait of coming of age in a dangerous time and an epic tale of a nation divided. Women can be heroes. When twenty-year-old nursing student Frances “Frankie” McGrath hears these words, it is a revelation. Raised in the sun-drenched, idyllic world of Southern California and sheltered by her conservative parents, she has always prided herself on doing the right thing. But in 1965, the world is changing, and she suddenly dares to imagine a different future for herself. When her brother ships out to serve in Vietnam, she joins the Army Nurse Corps and follows his path. As green and inexperienced as the men sent to Vietnam to fight, Frankie is over-whelmed by the chaos and destruction of war. Each day is a gamble of life and death, hope and betrayal; friendships run deep and can be shattered in an instant. In war, she meets—and becomes one of—the lucky, the brave, the broken, and the lost. But war is just the beginning for Frankie and her veteran friends. The real battle lies in coming home to a changed and divided America, to angry protesters, and to a country that wants to forget Vietnam. The Women is the story of one woman gone to war, but it shines a light on all women who put themselves in harm’s way and whose sacrifice and commitment to their country has too often been forgotten. A novel about deep friendships and bold patriotism, The Women is a richly drawn story with a memorable heroine whose idealism and courage under fire will come to define an era."
        },
        "Feminism or Death": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=VkAyEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=VkAyEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Francoise d'Eaubonne"
            ],
            "categories": [
                "Social Science"
            ],
            "published_date": "2022-03-08",
            "sale_price": 7.99,
            "description": "The passionately argued, incendiary French feminist work that first defined “eco-feminism”—now available for the first time in English Originally published in French in 1974, radical feminist Francoise d’Eaubonne surveyed women’s status around the globe and argued that the stakes of feminist struggle was not about equality but about life and death—for humans and the planet. In this wide-ranging manifesto, d’Eaubonne first proposed a politics of ecofeminism, the idea that the patriarchal system's claim over women's bodies and the natural world destroys both, and that feminism and environmentalism must bring about a new “mutation”—an overthrow of not just male power but the system of power itself. As d’Eaubonne prophesied, “the planet placed in the feminine will flourish for all.” Never before published in English, and translated here by French feminist scholar Ruth Hottell, this edition includes an introduction from scholars of ecology and feminism situating d’Eaubonne’s work within current feminist theory, environmental justice organizing, and anticolonial feminism."
        },
        "Women's Lives": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=s6J8zgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=s6J8zgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "authors": [
                "Claire Etaugh",
                "Judith S. Bridges"
            ],
            "categories": [
                "Women"
            ],
            "published_date": "2022-05-30",
            "sale_price": null,
            "description": "Taking a deeper transnational focus, it also examines the impact of social, cultural, and economic factors in shaping women's lives around the world.This edition explores the latest areas of research and tackles important contemporary topics such as:- feminization of immigration- media portrayals of LGBTQ individuals and immigrants- regulating testosterone levels in women's sports; disorders of sexual development; nonbinary identity- the effects of social media on body image; sizeism- new classification of sexual disorders- menstrual equity and the \"tampon tax\"- migrant women as transnational mothers- academic environment for low-income, ethnic minority, ."
        },
        "Women and Politics": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=ydg7EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=ydg7EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Julie Dolan",
                "Melissa M. Deckman",
                "Michele L. Swers"
            ],
            "categories": [
                "Political Science"
            ],
            "published_date": "2021-08-17",
            "sale_price": null,
            "description": "Women and Politics: Paths to Power and Political Influence examines the role of women in politics from the early women’s movement to the female politicians in power today. Focusing on women whose stories have not yet been told, this book includes new analysis and scholarship on the experiences and viewpoints of conservative women, women of color, LGBT women, and millennial women."
        },
        "Women's Work": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=2jItzwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=2jItzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "authors": [
                "Lea McComas"
            ],
            "categories": null,
            "published_date": "2022-07",
            "sale_price": null,
            "description": "In celebration of the 100th anniversary of the 19th Amendment giving women in the US the right to vote, and the 25th anniversary of Hillary Clinton's speech at the International Women's conference in Beijing, China, Lea McComas created the art quilt Women's Work. It honors women for their achievements in the fight for gender and racial equality, and the protection of human rights. Women's Work, the book, shares stories about how and why the quilt was made, along with the biographies of each of the 57 amazing women it depicts. Learn about their struggles, and accomplishments while gaining a deeper understanding and appreciation for the significant contributions of women in our world."
        },
        "Women and Gender in Islam": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=TkIaEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=TkIaEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Leila Ahmed"
            ],
            "categories": [
                "Social Science"
            ],
            "published_date": "2021-03-16",
            "sale_price": 20,
            "description": "A classic, pioneering account of the lives of women in Islamic history, republished for a new generation This pioneering study of the social and political lives of Muslim women has shaped a whole generation of scholarship. In it, Leila Ahmed explores the historical roots of contemporary debates, ambitiously surveying Islamic discourse on women from Arabia during the period in which Islam was founded to Iraq during the classical age to Egypt during the modern era. The book is now reissued as a Veritas paperback, with a new foreword by Kecia Ali situating the text in its scholarly context and explaining its enduring influence. “Ahmed’s book is a serious and independent-minded analysis of its subject, the best-informed, most sympathetic and reliable one that exists today.”—Edward W. Said “Destined to become a classic. . . . It gives [Muslim women] back our rightful place, at the center of our histories.”—Rana Kabbani, The Guardian"
        },
        "Women and the Economy": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=0hlHEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=0hlHEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Saul D. Hoffman",
                "Susan L. Averett"
            ],
            "categories": [
                "Business & Economics"
            ],
            "published_date": "2021-03-11",
            "sale_price": 57.56,
            "description": "An analysis of the enormous changes in women's economic lives around the world, from the family to the labour market. Hoffman and Averett examine topics such as the effect of rising women's wages and improved labour market opportunities on marriage, the ways in which more reliable contraception has shaped women's adult lives and careers, and the forces behind the phenomenal rise in women's labour force activity. This fourth edition includes brand new chapters on gender in economics and race and gender in the USA. It incorporates the latest research findings throughout, many of which are featured in helpful call-out boxes, and illustrated with new graphs and figures. This is invaluable reading for undergraduate and postgraduate students of economics, development and women's studies. The level of economic analysis is suitable for students with basic economics knowledge. New to this Edition: - New chapters on gender in economics and race and gender in economics - Fully updated with new data, policy examples and a new companion website with lecturer resources - Increased pedagogy, with over 30 new boxes"
        }
    },
    "college": {
        "The Black Family's Guide to College Admissions": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=BwTMEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=BwTMEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Timothy L. Fields",
                "Shereem Herndon-Brown"
            ],
            "categories": [
                "Study Aids"
            ],
            "published_date": "2024-01-15",
            "sale_price": 22.95,
            "description": "Named one of the Top 2023 College Admissions Resources by Forbes Featured on NPR as \"Book of the Day\" and on Marketplace \"Game changer, and long overdue\"—Angel B. Pérez, CEO of the National Association for College Admission Counseling Finding the right college is a challenge for all students, but Black families face additional challenges and questions when navigating the admissions process. Veteran admissions experts Timothy L. Fields and Shereem Herndon-Brown demystify this complexity by advising families on when to begin the process, where to apply, and how to be a competitive applicant. Fields and Herndon-Brown address specific concerns that are not often addressed by school counselors or other resources. They highlight how recent social justice movements and legal cases have amplified the necessity of considering both Historically Black Colleges and Universities and predominantly white institutions, while covering everything from athletic recruitment and artistic talents to financial aid and step-by-step instructions for how to search for colleges and then apply to them. The second edition includes new chapters on • prioritizing students' and parents' mental health, • understanding the influence of artificial intelligence tools such as ChatGPT on college essay writing, • reviewing recent Supreme Court decisions about race-conscious admission and their likely impact on Black applicants, and • navigating the admission process as a transfer applicant. A list of the best colleges for Black students, a glossary of terms, a list of notable Black college graduates and their alma maters, a suggested reading list, and an FAQ section round out the guide. Having worked on both sides of the desk—as school counselors and as college admissions gatekeepers—Fields and Herndon-Brown are well equipped to give parents, students, and school counselors the information and inspiration to research a variety of schools, understand their choices, and define success on their own terms."
        },
        "Surviving the College Application Process": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=2kLVEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=2kLVEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Jennifer Romano"
            ],
            "categories": [
                "Juvenile Nonfiction"
            ],
            "published_date": "2023-12-05",
            "sale_price": 9.99,
            "description": "The college admissions landscape and the steps to apply can be overwhelming and confusing! This mini guide is a quick resource highlighting key components to consider in the effort to decode and demystify the college application process for the college-bound student and their family. Covering topics such as essential application components, standardizing testing, personal statements, and financial aid, Surviving the College Application Process is your secret weapon for navigating the college research, planning, and selection process. Light-hearted and accessible, this book can be read from cover to cover or referenced as needed by college-bound students, their families, school counselors, and anyone interested in post-secondary education."
        },
        "The Truth about College Admission": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=3bXREAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=3bXREAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Brennan Barnard",
                "Rick Clark"
            ],
            "categories": [
                "Education"
            ],
            "published_date": "2023-09-05",
            "sale_price": null,
            "description": "\"A guide for students and families that demystifies the college process\"--"
        },
        "Understanding the Working College Student": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=hc7KEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=hc7KEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Laura W. Perna"
            ],
            "categories": [
                "Education"
            ],
            "published_date": "2023-07-14",
            "sale_price": 31.16,
            "description": "How appropriate for today and for the future are the policies and practices of higher education that largely assume a norm of traditional-age students with minimal on-campus, or no, work commitments?Despite the fact that work is a fundamental part of life for nearly half of all undergraduate students – with a substantial number of “traditional” dependent undergraduates in employment, and working independent undergraduates averaging 34.5 hours per week – little attention has been given to how working influences the integration and engagement experiences of students who work, especially those who work full-time, or how the benefits and costs of working differ between traditional age-students and adult students.The high, and increasing, prevalence and intensity of working among both dependent and independent students raises a number of important questions for public policymakers, college administrators, faculty, academic advisors, student services and financial aid staff, and institutional and educational researchers, including: Why do so many college students work so many hours? What are the characteristics of undergraduates who work? What are the implications of working for students’ educational experiences and outcomes? And, how can public and institutional policymakers promote the educational success of undergraduate students who work? This book offers the most complete and comprehensive conceptualization of the “working college student” available. It provides a multi-faceted picture of the characteristics, experiences, and challenges of working college students and a more complete understanding of the heterogeneity underlying the label “undergraduates who work” and the implications of working for undergraduate students’ educational experiences and outcomes. The volume stresses the importance of recognizing the value and contribution of adult learners to higher education, and takes issue with the appropriateness of the term “non-traditional” itself, both because of the prevalence of this group, and because it allows higher education institutions to avoid considering changes that will meet the needs of this population, including changes in course offerings, course scheduling, financial aid, and pedagogy."
        },
        "College Drinking": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=ZhHJEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=ZhHJEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "George W. Dowdall"
            ],
            "categories": [
                "Education"
            ],
            "published_date": "2023-07-03",
            "sale_price": 29.19,
            "description": "Drinking is recognized as one of the most important problems confronting students on campus today, with major impacts on health and safety.This book answers crucial questions about why students drink, examines its complex links to campus crime and sexual assault, and offers new insights on how to address the issue.It differs from other studies of college drinking by dispelling the myth that the problem is universal. Dowdall’s research reveals that the incidence of alcohol abuse varies enormously between colleges, and in doing so identifies interventions and policies that have been effective, and those that have failed. His study is also unique in looking “upstream” at the broader cultural, organizational and social forces that shape this behavior, where most studies focus only on “downstream” behaviors, well after students have selected their college and have started drinking. Students and parents can take action to lower the risk of binge drinking by following the book’s recommendations, and consulting the data it provides about alcohol violations and crime at thousands of colleges. For administrators and student affairs personnel, it both defines and illuminates the issue, and outlines effective interventions."
        },
        "The Community's College": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=0A_JEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=0A_JEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Robert L. Pura",
                "Tara L. Parker"
            ],
            "categories": [
                "Education"
            ],
            "published_date": "2023-07-03",
            "sale_price": 31.16,
            "description": "Co-published with An Agenda for Leaders / A Text for Leadership CoursesWhile community colleges promote American ideals of democracy, opportunity, and social mobility; they provide a vital, accessible, and affordable education for nearly 12 million first-generation, economically-disadvantaged, and minoritized students; are engines of local workforce and economic development; and enroll nearly half of all students who go on to complete a four-year degree; they remain the least resourced and the least funded institutions in the United States.Offering the insights of the former president of Greenfield Community College—located in Massachusetts’s poorest rural county—who was a national leader in community college and higher education organizations as well as closely involved with local businesses and organizations; and commentary and background data provided by Professor of Higher Education and Chair of the Department of Leadership in Education at the University of Massachusetts Boston, this book addresses the challenges that community colleges face as they strive to achieve their complex missions in a changing world.By providing vivid accounts of the diversity of students that community colleges serve, the complexity of their missions—from dual enrollment with high schools, to vocational training, adult education, and transfer to four-year colleges—and the role they play in supporting and responding to the needs of local business, as well in regional economic development, the authors make the case for increased investment, while at the same time making apparent to all stakeholders—from policy makers and trustees to college leaders, faculty and staff—how they can contribute to the vital development of human capacities.Community colleges are open-access, train nearly 80% of all first responders, graduate more than half of new nurses and health-care workers, and have a history of nimbleness and responsiveness to community needs, and can play a vital role in training for tomorrow’s jobs, over 60% of which will, in the next decade, require some college education. The first four chapters set the scene, demonstrating the key foundational linkage between education, community, and democracy, presenting a history of the community college movement, illustrating what’s involved in building strong and reciprocal community relationships, and covering a whole panoply of leadership issues such as governance, institutional culture, facilities planning, resource development, accreditation, and crisis management.The second part of the book presents Bob Pura’s accounts of his visits to five community colleges, each representing different geographic regions, institutional size, urban and rural locations, and how they respond to the varied racial and ethnic populations from they draw their students and establish themselves as anchors in their communities.As well as offering an important message to state and federal policy makers, this book serves as a roadmap for aspiring leaders of community colleges as well as a text for leadership and higher education courses. College leaders may find it useful for internal training and learning community groups."
        },
        "College in the Crosshairs": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=qBDJEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=qBDJEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Brian O. Hemphill",
                "Brandi Hephner LaBanc"
            ],
            "categories": [
                "Education"
            ],
            "published_date": "2023-07-03",
            "sale_price": 31.78,
            "description": "Gun violence – whether rampage shootings, homicides or suicides – is a potential reality all campuses have to face. This book provides leaders in higher education – and particularly those in student affairs – with data about past incidents, an analysis of trends, and background on the national debate about gun policies and how they impact colleges, state by state. It importantly raises issues about student psychological development, mental health, and the prevalence of alcohol and substance abuse on campus, to better inform discussion about allowing guns on campus and concealed carry. It concludes by sharing strategies for averting gun-related tragedies, and offering models for responding when they occur, based on lessons learned and best practices. The book addresses concealed carry legislation and its impact on campus policies by state, examining the concerns of administrators as they discharge their duty of care to students and comply with legal and regulatory frameworks. Asking “Are our students developmentally ready to make a morally sophisticated, life-changing decision to use firearms in response to a real or perceived threat?”, it offers important perspectives and scientific data, so far absent from the debate, to shape the ongoing conversation with lawmakers and the public about what it takes to keep college communities safe.In addressing risk and prevention, contributors cover the relationship between violence and mental health, and the need to establish comprehensive strategic plans and a preventative framework that promotes help-seeking for those in need before they reach the point of crisis, as well as a campus-wide risk assessment team, stressing the importance of cultivating a community-wide approach to campus safety by empowering members to report suspicious behavior. They also offer guidance on improving effective behavior intervention and case management processes.The book concludes by outlining best practices, and providing guidance on developing an emergency plan, practicing and testing systems, and creating a robust communications strategy. Individual chapters focus on how small colleges with limited resources can develop effective plans into by partnering with local agencies; as well as on the steps that community colleges – who generally lack resident advisors and residential staff, and whose students are far more dispersed – can take to diminish risk and respond promptly and professionally to a crisis.This is an essential guide for all higher education leaders concerned about preventing violence on our campuses, and a call to action."
        },
        "Understanding College and University Organization": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=QBDJEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=QBDJEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "James L. Bess",
                "Jay R. Dee"
            ],
            "categories": [
                "Education"
            ],
            "published_date": "2023-07-03",
            "sale_price": 39.46,
            "description": "Now available in paperback, this two-volume work is intended to help readers develop powerful new ways of thinking about organizational principles, and apply them to policy-making and management in colleges and universities.The book is written with two audiences in mind: administrative and faculty leaders in institutions of higher learning, and students (both doctoral and Master's degree) studying to become upper-level administrators, leaders, and policy makers in higher education.It systematically presents a range of theories that can be applied to many of the difficult management situations that college and university leaders encounter. It provides them with the theoretical background to knowledgeably evaluate the many new ideas that emerge in the current literature, and in workshops and conferences. The purpose is to help leaders develop their own effective management style and approaches, and feel confident that their actions are informed by appropriate theory and knowledge of the latest research in the field.Without theory, organizational leaders are forced to treat each problem that they encounter as unique–as if it were a first-time occurrence. While leaders may have some experience with a particular issue, their solutions are usually not informed by the accumulated wisdom of others who have already encountered and resolved similar situations. The authors approach the theory of the organization and administration of colleges and universities from three quite different perspectives, or paradigms, each relying on different assumptions about the “reality” of organizational life in colleges and universities. The positivist paradigm–primarily an omnibus systems theory–integrates the chapters into a comprehensive, yet easily accessible whole. Social constructionism, the second paradigm, is introduced in each chapter to illuminate the difficulty of seeking and finding meaningful consensus on problems and policies, while also addressing important ethical issues that tend to be overlooked in leadership thought and action. The third paradigm, postmodernism, draws attention to difficulties of logic and communication under the constraints of strictly linear thinking that “authorities” at all levels attempt to impose on organizations.This “multiple paradigm” approach enables readers to become more cognizant of their own assumptions, how they may differ from those of others in their organization, and how those differences may both create difficulties in resolving problems and expand the range of alternatives considered in organizational decision making. The book offers readers the tools to balance the real-world needs to succeed in today’s challenging and competitive environment with the social and ethical aspirations of all its stakeholders and society at large. The authors’ aim is to elucidate how administration can be made more efficient and effective through rational decision-making while also respecting humanistic values. This approach highlights a range of phenomena that require attention if the institution is ultimately to be considered successful.Also available:Volume 1: The State of the SystemTwo volume set"
        },
        "The Community College Baccalaureate": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=dg7JEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=dg7JEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Deborah L. Floyd",
                "Michael L. Skolnik",
                "Kenneth P. Walker"
            ],
            "categories": [
                "Education"
            ],
            "published_date": "2023-07-03",
            "sale_price": 29.19,
            "description": "* Is the conferring of baccalaureate degrees by community colleges a solution to increasing access to and capacity in higher education?* Will the conferring of baccalaureate degrees restrict open access to, and imperil the existing mission of, community colleges?* What are the models and alternative methods of delivery? What are the implications?Breaking away from their traditional mission of conferring only associate degrees and occupational credentials, an increasing number of community colleges have begun seriously to explore and, indeed, in some U.S. states and Canadian provinces, to actually implement offering and conferring bachelor’s degrees. Some leaders see these changes as a natural extension of community colleges’ commitment to access, while others view their awarding of baccalaureate degrees as inappropriate and threatening the basic core values of this unique sector of higher education. This has become a \"hot\" and controversial topic, not only among community college and university leaders, but also among policy makers, business leaders and students concerned with issues of access, cost and the structure and purposes of post-secondary education. This book analyzes the emerging trend of the community college baccalaureate degree in the United States and Canada in order to contribute to the development of policy. The authors aim to describe, document, and explain this significant development in higher education. They present the background, examples of practice and different models of delivery, develop a common terminology to facilitate discussion, give voice to the views of proponents and critics alike, and include a comprehensive bibliography and set of resources. This book is intended as a catalyst for dialog, action and further research on this critical and emerging trend. It is essential reading for leaders of community colleges, for administrators and planners in higher education concerned with issues of access and articulation, and anyone in public policy grappling with demographic trends and society’s need for educated citizens able to meet the challenges of the future."
        },
        "Community College Leadership": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=GhHJEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=GhHJEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Pamela L. Eddy"
            ],
            "categories": [
                "Education"
            ],
            "published_date": "2023-07-03",
            "sale_price": 19.22,
            "description": "Two-year colleges are facing major change. The majority will undergo a turnover in college presidencies in the next ten years, at a time when they are being asked to be engines for economic growth, enable more students – and a greater diversity of students – to gain 21st century qualifications, and provide a pathway to higher degrees, all with reduced state and local funding. Recognizing that future community college leaders – at all levels– will manage increasingly complex organizations, and face very different challenges than their predecessors, this book provides a multidimensional model of leadership suited to these new demands and environments. The model addresses issues of leader cognition, race and gender, the importance of culture, and the need for more collaborative modes of communication and decision making to frame and implement change. It recognizes that there is no longer any one way to lead, and that the next generation of leaders will be more diverse, possess experience and qualifications from a wider variety of careers, and follow new pathways to their positions. Leaders in the future will possess a cultural competency that is fostered by being lifelong learners.Through over 75 individual interviews with leaders and campus members, Eddy is able to provide examples of the model’s components in practice and to illuminate which experiences proved the most relevant for these leaders on their route to upper administration. She shows how her model intersects with the leadership competencies defined by the American Association of Community Colleges, and proposes strategies for future leadership development. This book is intended for anyone considering a leadership position, at any level, in a community college; for college administrators and boards responsible for leadership development programs; and for individuals in corresponding organizations who conduct training programs for aspiring leaders. Likewise, those employed at four-year universities may find value in the model as a developmental tool."
        }
    },
    "games": {
        "The Game Changer": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=Hm4m0AEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=Hm4m0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "authors": [
                "Lana Ferguson"
            ],
            "categories": [
                "Fiction"
            ],
            "published_date": "2024-07-09",
            "sale_price": null,
            "description": "A hockey player and a baker shoot their shot in this steamy new romance by Lana Ferguson, USA Today bestselling author of The Nanny. When a very public breakup becomes a PR nightmare for Ian Chase's team, he hopes to focus on his game, but that suddenly seem less likely than a hat trick. With his career and the team's image in jeopardy, Ian is surprised to find a solution through none other than Delilah Baker, his best friend and teammate's little sister . . . who isn't so little anymore. Delilah Baker is known as 'the darling of baking' on her local cable show, and being in the public eye is her bread and butter. But with her numbers dwindling and her producers turning up the heat, Delilah offers up the half-baked idea to collaborate with her brother's team to entice the hockey fans of Boston to tune in to her show. Delilah thinks it will be a piece of cake - until the team sends Ian Chase, her brother's best friend and the object of a decade-long crush that she's never quite gotten over. Delilah's and Ian's teams think it's a true win-win situation - gaining higher numbers for Delilah's show and casting Ian in a more positive light. And viewers are eating them up like a cupcake, sparking the idea to play up their relationship for the goal of good press. With more than just their careers on thin ice, the line between what's real and what's for show begins to blur, but one thing's for certain: This PR stunt will either be a total game changer - or leave them both totally pucked. Praise for Lana Ferguson 'Addictive, epically smutty and the breath of fresh air the romance genre didn't know it needed' ELENA ARMAS 'Like if Ali Hazelwood and Tessa Bailey had a smutty baby. I devoured every page' RUBY DIXON 'Smart, fun, sexy, and sizzling with romantic tension' SARA DESAI 'Rosie Danan fans should snap this up' Publishers Weekly, starred review 'Funny, sweet, and very hot' Shondaland"
        },
        "The Most Relaxing Video Games": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=18TrEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=18TrEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Ryan Janes"
            ],
            "categories": [
                "Games & Activities"
            ],
            "published_date": "2024-05-30",
            "sale_price": null,
            "description": "Video games are so much more than just full throttle blasts of gunfights, violence and white-knuckle competition. They can also be beautiful, cosy and even emotionally uplifting journeys too. The ideal escapism after a day you’d sooner forget or the perfect sedative following a particularly stress-filled afternoon. The Most Relaxing Video Games will walk you through a selection of gaming experiences sure to help you unwind. From the familiar warmth of sitting down with a good classic board game (51 of them to be exact) through to the solving of hundreds of puzzles on a mysterious island using nothing but lines, there’s a world of delightfully comforting video games just waiting to sooth your gaming soul. Covering over 50 video games and spanning nearly thirty years, this comprehensive guide includes detailed explanations of every peaceful entry along with full-color screenshots, standout moments, fascinating facts and of course what it is that makes them such a relaxing alternative. Whether you’re a fan of racers, management sims, puzzles or platformers, there’s something here for everyone. So trade in your firearms for farming gear and punching fists for puzzles. Sit back, get comfy and discover the relaxing side that video games have to offer."
        },
        "Understanding Video Games": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=ypX7EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=ypX7EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Simon Egenfeldt-Nielsen",
                "Jonas Heide Smith",
                "Susana Pajares Tosca"
            ],
            "categories": [
                "Social Science"
            ],
            "published_date": "2024-05-08",
            "sale_price": 51.96,
            "description": "The fifth edition of this pioneering textbook takes video game studies into the next decade, highlighting changes in mobile, social, and casual gaming. This book introduces students to both the major theories used to analyze games, such as ludology and narratology, and the commercial and organizational aspects of the game industry. Drawing from historical and contemporary examples, this student-friendly text also explores the aesthetics of games, evaluates the cultural position of video games, and considers the potential effects of both violent and \"serious\" games. This new edition includes updates to the history, statistics, and developments in the vast game studies landscape throughout. The book has been expanded with additional theory, research, and insights from scholars around the world, making it more inclusive and broadening its global perspective. Extensively illustrated and featuring discussion questions, a glossary of key terms, and a detailed video game history timeline, Understanding Video Games, Fifth Edition is an indispensable resource for anyone interested in examining the ways video games are reshaping entertainment, education, and society."
        },
        "A Journey Through Gaming Worlds": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=qb_0EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=qb_0EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "GAMELADE",
                "GAME LÀ DỄ"
            ],
            "categories": [
                "Antiques & Collectibles"
            ],
            "published_date": "2024-02-15",
            "sale_price": null,
            "description": "Embark on an exhilarating odyssey through the immersive and captivating realms of video games with \"A Journey Through Gaming Worlds: Traversing the Multiverse of Video Games.\" In this captivating exploration, readers will delve into the evolution, creation, and allure of gaming worlds, from the fantastical realms of high fantasy to the futuristic galaxies of science fiction. From the origins of virtual realities to the revolutionary potential of virtual reality technology, this book offers a comprehensive journey into the diverse landscapes and narratives that define modern gaming. Whether you're a seasoned gamer or a curious enthusiast, prepare to be transported to new dimensions as we unravel the secrets and significance of gaming worlds in shaping our digital age."
        },
        "How Rocket League Became A Global Video Game Phenomenon, How Rocket League Changed People’s Lives, And How To Earn Revenue As A Rocket League Player": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=AVn_EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=AVn_EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Dr. Harrison Sachs"
            ],
            "categories": [
                "Games & Activities"
            ],
            "published_date": null,
            "sale_price": 14.99,
            "description": "This essay sheds light on how Rocket League became a global video game phenomenon, explicates how Rocket League changed people’s lives, and expounds upon how to earn revenue as a Rocket League player. Rocket League was able to achieve the stupendous feat of becoming a global video game phenomenon during its incipience. There are a myriad of disparate reasons as to why Rocket League was able to become global video game phenomenon during its genesis as one of the utmost popular vehicular soccer video games of all time as of November of 2023. Rocket League’s extreme popularity among gamers is not solely attributed to Rocket League being subsumed under the vehicular soccer video game subgenre. The vehicular soccer video game subgenre is a niche video game subgenre that lacks an extensive library of video games as of November of 2023. As a vehicular soccer video game, Rocket League is a far cry from a conventional soccer video game. Rocket League is an innovative vehicular soccer video game that features rocket-powered vehicles in Rocket League matches. Rocket League has ample online multiplayer game modes that extend beyond the ambit of Rocket League solely having an online multiplayer rumble mode. Some of the additional online multiplayer game modes in Rocket League encompass “dropshot, snow day, and hoops”. Moreover, Rocket League also has an offline training mode. Rocket League also offered limited-time online multiplayer game modes. Some of the ample limited-time online multiplayer game modes in Rocket League encompass “Beach Ball, Boomer Ball, Dropshot Rumble, Eggstra Special Mode, Gotham City Rumble, Spooky Cube, Spring Loaded, Super Cube, Tactical Rumble, Winter Breakaway, and Loophole”. Offering limited-time online multiplayer game modes that are available in Rocket League for a finite duration allows Psyonix to be able to further innovative its selection of online multiplayer game modes and entice more former rocket league players to recommence playing Rocket League who metaphorically migrated to the virtual settings of other videos games that also a surfeit of online multiplayer game modes. Even though it can be cumbersome to elicit a resurgence of interest in an old video game among the video game’s inactive player base whose interest in the outmoded video game have tapered off overtime, it is still nonetheless possible to entice these players to recommence playing an antiquated video game by significantly expanding its content offerings with the infusion of additional enthralling online multiplayer game modes in an old video game. Unbeknownst to most people, Rocket League is over 8.33 years old as of November 17th of 2023. Rocket League was released in the market amid the mid 2010s on July 7th of 2015. Rocket League’s released in the market was contemporaneous with the era of the eighth generation of video game home consoles. As of November 17th of 2023, a sequel video game to Rocket League has not been released even though Rocket League was released over 8.33 years old as of November 17th of 2023. Rocket League was released in the market amid the bygone era of the previous generation of video games home consoles, the era of the eighth generation of video game home consoles. Gamers who are apart of the Rocket League’s active player base are voraciously clamoring to play an engrossing and innovative sequel video game to Rocket League. As of November 17th of 2023, it is enigmatic if Psyonix will develop sequel video game to Rocket League sometime amid the era of the ninth generation of video game home consoles. Rocket League’s vast variety of game modes has rendered Rocket League all the more appealing to gamers than it otherwise would be if it had scant game modes. Gameplay sessions in Rocket League can appeal to gamers who have eclectic video game interests since Rocket League is replete with game modes that can allow gamers to bask in different types of gameplay experiences while playing Rocket League matches as a heroic vehicle. Rocket League is one of the utmost popular video games for gamers to watch live stream broadcasts of as of November of 2023. Rocket League has an exorbitant amount of vehicles that players can utilize in Rocket League matches. There are six different types of vehicles that players can utilize in Rocket League matches. The different types of vehicles that players can utilize in Rocket League matches encompass vehicles that have an octane hitbox, vehicles that have a dominus hitbox, and vehicles that have a plank hitbox."
        },
        "The Beauty of Games": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=XiGlEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=XiGlEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Frank Lantz"
            ],
            "categories": [
                "Games & Activities"
            ],
            "published_date": "2023-10-03",
            "sale_price": 14.99,
            "description": "How games create beauty and meaning, and how we can use them to explore the aesthetics of thought. Are games art? This question is a dominant mode of thinking about games and play in the twenty-first century, but it is fundamentally the wrong question. Instead, Frank Lantz proposes in his provocative new book, The Beauty of Games, that we think about games and how they create meaning through the lens of the aesthetic. We should think of games, he writes, the same way we think about literature, theater, or music—as a form that ranges from deep and profound to easy and disposable, and everything in between. Games are the aesthetic form of interactive systems, a set of possibilities connected by rules of cause and effect. In this book, Lantz analyzes games from chess to poker to tennis to understand how games create beauty and evoke a deeper meaning. He suggests that we think of games not only as hyper-modern objects but also as forms within the ancient context of artistic production, encompassing all of the nebulous and ephemeral qualities of the aesthetic experience."
        },
        "Let's Play": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=d_-pEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=d_-pEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Nancy Dickmann"
            ],
            "categories": [
                "Juvenile Nonfiction"
            ],
            "published_date": "2023-09-26",
            "sale_price": null,
            "description": "Let's Play is the perfect companion for kids looking to fill afternoons with fun, while learning about other countries and cultures in an interactive and engaging way."
        },
        "Practical Game Design": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=fFHNEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=fFHNEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Adam Kramarzewski",
                "Ennio De Nucci"
            ],
            "categories": [
                "Computers"
            ],
            "published_date": "2023-08-18",
            "sale_price": 31.19,
            "description": "Arm yourself with the practical skills and cutting-edge insights necessary to successfully design captivating games across a variety of genres and platforms Purchase of the print or Kindle book includes a free PDF eBook Key Features Master the skills, processes, and techniques essential for working in a professional setting Grasp the core principles and processes of level design, world building, and storytelling Design, implement, and refine high-quality features and mechanics for contemporary video games Book DescriptionIf you’re in search of a cutting-edge actionable guide to game design, your quest ends here! Immerse yourself in the fundamentals of game design with expert guidance from veterans with decades of game design experience across a variety of genres and platforms. The second edition of this book remains dedicated to its original goal of helping you master the fundamentals of game design in a practical manner with the addition of some of the latest trends in game design and a whole lot of fresh, real-world examples from games of the current generation. This update brings a new chapter on games as a service, explaining the evolving role of the game designer and diving deeper into the design of games that are meant to be played forever. From conceptualizing a game idea, you’ll gradually move on to devising a design plan and adapting solutions from existing games, exploring the craft of producing original game mechanics, and eliminating anticipated design risks through testing. You’ll then be introduced to level design, interactive storytelling, user experience and accessibility. By the end of this game design book, you’ll have learned how to wrap up a game ahead of its release date, work through the challenges of designing free-to-play games and games as a service, and significantly improve their quality through iteration, playtesting, and polishing.What you will learn Define the scope and structure of a game project Conceptualize a game idea and present it to others Design gameplay systems and communicate them clearly and thoroughly Build and validate engaging game mechanics Design successful games as a service and prepare them for live operations Improve the quality of a game through playtesting and meticulous polishing Who this book is for Whether you are a student eager to design your very first game or a game designer looking to expand your skill set, this book will help you master the fundamentals of game design across all stages of game development. With a focus on best practices and a pragmatic approach, Practical Game Design offers insights into the art and craft of game design from two senior game designers, with insider knowledge that even veterans will find valuable. While prior experience with game development is not absolutely necessary, having basic knowledge of popular video games will prove helpful."
        },
        "The Game Narrative Toolbox": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=1K3GEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=1K3GEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "authors": [
                "Tobias Heussner",
                "Toiya Kristen Finley",
                "Jennifer Brandes Hepler",
                "Ann Lemay"
            ],
            "categories": [
                "Computers"
            ],
            "published_date": "2023-08-16",
            "sale_price": 55.96,
            "description": "Learn how to create compelling game storylines. Four experienced narrative designers from different genres of game development have banded together to create this all-inclusive guide on what it's like to work as a writer and narrative designer in the video game industry. From concept to final testing, The Game Narrative Toolbox walks readers through what role a narrative designer plays on a development team and what the requirements are at every stage of development. Drawing on real experiences, authors Tobias Heussner, Toiya Kristen Finley, PhD, Ann Lemay, and Jennifer Brandes Hepler provide invaluable advice for writing compelling player-centered stories and effective dialogue trees to help readers make the switch from writing prose or screenplay to interactive. Thoroughly revised, the Second Edition includes updated content reflecting the industry’s latest developments. In addition to revised and updated chapters, this new edition features two additional chapters covering more advanced topics that are applicable to the lessons learned from the original chapters. Accompanying every chapter are exercises that allow the reader to develop their own documentation, outlines, and game-dialogue samples for use in applying for industry jobs or developing independent projects."
        },
        "Let's Play Games": {
            "image": {
                "smallThumbnail": "http://books.google.com/books/content?id=r_lw0AEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=r_lw0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "authors": [
                "Dana Strick"
            ],
            "categories": [
                "Games & Activities"
            ],
            "published_date": "2024-01-06",
            "sale_price": null,
            "description": "Gather the family around the table for an unforgettable game night! With this book, find easy-to-follow instructions for classic dice, card, and domino games that everyone loves. Discover the origins of these timeless games and enjoy the priceless connection that comes from connecting with family and friends face-to-face. Plus, save money with these fun and affordable activities. Benefits from reading this book: - Create lasting memories and connections with family and friends - Spend quality time together without breaking the bank - Transform family night into a fun-filled adventure What's included in this book: - Dice games - Card games - Games with Dominoes - Games with Marbles or Seeds Take advantage of this opportunity to make family night unforgettable!"
        }
    }
}